final_project/cases_lift/base_case_angle2_5/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices        
(
    (-4 -2 -3)
    (9 -2 -3)
    (9  2  -3)
    (-4  2  -3)
    (-4 -2 3)
    (9 -2 3)
    (9 2 3)
    (-4 2 3)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (85 25 45) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch sym1 
    (
        (3 7 6 2)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch sym2
    (
        (1 5 4 0)
    )
    patch bottom
    (
        (0 3 2 1)
    )
    patch top
    (
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);


// ************************************************************************* //
